Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: For Listview items several states can be returned as $GUI_CHECKED and $GUI_UNCHECKED (only for listview controls with LVS_EX_CHECKBOXES-exstyle and on 'advanced' return) .So use i.e.
fr: Pour les items Listview plusieurs états peuvent être retournés comme $GUI_CHECKED et $GUI_UNCHECKED (uniquement pour les contrôles Listview avec LVS_EX_CHECKBOXES-exstyle et avec retour 'avancé').

source: BitAND(GUICtrlRead($Item),$GUI_CHECKED) to test if the item is checked.
fr: Donc, utilisez BitAND(GUICtrlRead($item),$GUI_CHECKED) pour tester si l'item est cochée.

source: For Treeview items several states can be returned as $GUI_FOCUS, $GUI_EXPAND and $GUI_CHECKED, $GUI_UNCHECKED (only for treeview controls with TVS_CHECKBOXES-style .So use i.e.
fr: Pour les items de Treeview plusieurs états peuvent être retournés comme $GUI_FOCUS, $GUI_EXPAND et $GUI_CHECKED$, $GUI_UNCHECKED (uniquement pour les contrôles Treeview avec TVS_CHECKBOXES-style.

source: the focus is on this button
fr: le focus est mis sur ce bouton

source: display the selected listbox entry
fr: Affiche l'entrée de zone de liste sélectionnée

source: return the state of the menu item
fr: renvoie l'état de l'item du menu

source: return the text of the menu item
fr: renvoie le texte de l'item du menu

source: type of message to be send to the control as defined in the Windows controls documentation.
fr: Type de message à envoyer au contrôle tel que défini dans la documentation des contrôles Windows.

source: An integer first param to be send to the control.
fr: Un premier paramètre 'integer' à envoyer au contrôle.

source: Define the type of lParam that will be returned:
fr: Définit le type de lParam qui sera retourné :

source: 0 (default) for wParam and lParam, 1 for lParam String, 2 for lParam RECT struct.
fr: 0 (par défaut) pour wParam et lParam, 1 pour lParam-String, 2 pour lParam RECT-structure.

source: the value returned by the SendMessage Windows API.
fr: Retourne la valeur renvoyée par l'API SendMessage Windows.

source: This function allows the sending of special Windows messages directly to the control using the SendMessage API.
fr: Cette fonction permet d'envoyer des messages Windows spéciaux directement au contrôle en utilisant l'API SendMessage.

source: It is used to enable special control features not available with the simple GUICtrlRead() and GUICtrlUpdate... range of functions.
fr: Elle est utilisée pour activer des fonctions spéciales de contrôle non disponibles avec le simple éventail de fonctions GUICtrlRead() and GUICtrlUpdate....

source: If the wParam and lParamType parameters are not specified then an array of two elements is returned (LPwParam, LPlParam).
fr: Si les paramètres wParam et lParamType ne sont pas spécifiés, alors un tableau de deux éléments est retourné (LPwParam, LPlParam).

source: The RECT is returned in an array of 4 elements (Left, Top, Right, Bottom).
fr: Le RECT est retourné dans un tableau de 4 éléments ((Left, Top, Right, Bottom).

source: Create a GUI with an edit control.
fr: Crée une interface graphique avec un contrôle d'édition.

source: Set data of the edit control.
fr: Réglages des données du contrôle d'édition.

source: Set focus to the edit control.
fr: Définit le focus sur le contrôle d'édition.

source: Initialize the variable $aCtrlRecvMsg for storing the value returned by GUICtrlRecvMsg.
fr: Initialise la variable $aCtrlRecvMsg pour stocker la valeur retournée par GUICtrlRecvMsg.

source: Send the message EM_GETSEL, to retrieve the current selection of the edit control.
fr: Envoie le message EM_GETSEL, pour récupérer la sélection en cours du contrôle d'édition.

source: If GUICtrlRecvMsg returned the value of 0, then an error occurred otherwise display the contents of the array.
fr: Si GUICtrlRecvMsg a retourné la valeur 0, une erreur s'est produite sinon afficher le contenu du tableau.

source: Register a user defined function for an internal listview sorting callback function.
fr: Enregistre une fonction 'callback' définie par l'utilisateur pour un tri interne d'une ListView.

source: The listview controlID for which the user function should proceed.
fr: Le controlID de la Listview pour lequel la fonction de l'utilisateur doit procéder.

source: The name of the user function to call when the sorting callback runs.
fr: Le nom de la fonction utilisateur à appeler lorsque le tri 'callback' doit être exécuté.

source: To make the user function workable you have to define it with maximum 4 function parameters otherwise the function won't be called !!!
fr: Pour que la fonction utilisateur fonctionne, vous devez la définir avec au plus 4 paramètres sinon la fonction ne sera pas appelée!!!

source: i.e:
fr: Exemple:

source: Or
fr: ou

source: When the user function is called then these 4 parameters have the following values:
fr: Lorsque la fonction utilisateur est appelée alors ces quatre paramètres ont les valeurs suivantes :

source: The controlID of the listview control for which the callback function is used.
fr: Le controlID du contrôle Listview pour lequel la fonction de rappel est utilisée.

source: The lParam value of the first item (by default the item controlID).
fr: La valeur lParam du premier item (par défaut l'item controlID).

source: The lParam value of the second item (by default the item controlID).
fr: La valeur lParam du deuxième item (par défaut l'item controlID ).

source: column
fr: colonne

source: The column that was clicked for sorting (the first column number is 0).
fr: La colonne qui a été cliquée pour être triée (le numéro de la première colonne est 0).

source: The following values have to be Returned to change the behaviour of the sorting callback:
fr: Les valeurs suivantes ont été Retournées pour changer le comportement de la fonction de tri 'callback':

source: Return value
fr: Valeur retournée

source: Meaning
fr: Signification

source: 1st item should precede the 2nd.
fr: Le 1er item doit précéder la 2nd.

source: No Change.
fr: Pas de changement.

source: 1st item should follow the 2nd.
fr: Le 1er item devrait suivre le 2ème.

source: See also examples for sorting with self created GUI listview items.
fr: Consultez aussi les exemples pour trier avec auto-création les items de la Listview.

source: sorting 3 column's different
fr: Tri de 3 colonnes différentes

source: Register the function "SortLV" for the sorting callback
fr: Crée la fonction \" SortLV \" pour le rappel de tri

source: Our sorting callback funtion
fr: Notre fonction tri callback

source: Switch the sorting direction
fr: Change la direction du tri

source: If it is the 3rd colum (column starts with 0) then compare the dates
fr: Si c'est le 3ème colonne (celle qui commence par 0), alors compare les dates

source: No change of item1 and item2 positions
fr: Pas de changement pour les positions de item1 et item2

source: Put item2 before item1
fr: Met item2 avant item1

source: Put item2 behind item1
fr: Met item2 derrière item1

source: Retrieve the text of a listview item in a specified column
fr: Obtient le texte d'un item listview dans une colonne spécifiée

source: sorting with selfcreated items by DllCall
fr: tri avec auto-création des items par DllCall

source: Create and insert items directly into the listview
fr: Crée et insére des items directement dans la Listview

source: Save the item text in the struct
fr: Enregistrez le texte de l'élément dans la structure

source: Set the lParam of the struct to the line index - unique within the listview
fr: Définit le lParam de la structure sur l'index unique de ligne dans le listview

source: Insert now the rest of the column text
fr: Insére maintenant le reste du texte de la colonne

source: Store the subitem index
fr: Stocker l'index de sous-élément

source: Change the column width to fit the item text
fr: Change la largeur de colonne pour ajuster le texte de l'item

source: type of message to be send to the control as defined in the Windows control documentation.
fr: type de message à envoyer au contrôle tel que défini dans la documentation de configuration de Windows.

source: The first param to send to the control.
fr: Le premier paramètre à envoyer au contrôle.

source: The second param to send to the control.
fr: Le second param à envoyer au contrôle.

source: It is used to enable special control features not available with the simple GUICtrlRead() and GUICtrlUpdate.... range of functions.
fr: Elle est utilisée pour activer les fonctions de contrôlse spéciaux qui ne sont pas disponibles avec le simple éventail de fonctions GUICtrlRead() et GUICtrlUpdate....

source: The parameters (wParam and lParam) can be an integer or a string.
fr: Les paramètres (wParam et lParam) peut être un entier ou une chaîne.

source: GUICtrlSendMsg() should be used for messages that have no special return types.
fr: GUICtrlSendMsg() devrait être utilisée pour des messages qui n'ont pas de types de retour spéciaux.

source: For more advanced messages where you must be able to receive extra data you must use GUICtrlRecvMsg().
fr: Pour plus de messages avancées où vous devez être en mesure de recevoir des données supplémentaires ...vous devez utiliser GUICtrlRecvMsg().

source: An example of starting/stopping a scrolling marquee of a progress bar.
fr: Un exemple de démarrage/arrêt d'une barre de progression.

source: Send the message $PBM_SETMARQUEE and wParam of 1 to start the scrolling marquee.
fr: Envoie le message $PBM_SETMARQUEE et WPARAM à 1 pour démarrer le défilement.

source: Send the message $PBM_SETMARQUEE and wParam of 0 to stop the scrolling marquee.
fr: Envoie le message $PBM_SETMARQUEE et WPARAM à 0 pour arrêter le défilement.

source: The control identifier (controlID) as returned by GUICtrlCreateDummy()
fr: L'identifiant du contrôle (controlID) tel que renvoyé par GUICtrlCreateDummy()

source: value that can be retrieved later on by GUICtrlRead()
fr: Valeur qui peut être récupéré plus tard par GUICtrlRead()

source: When this function is called a notification that can be handled through the message loop or with a GUICtrlSetOnEvent() function is generated (as if the control had been "clicked" on).
fr: Lorsque cette fonction est appelée, une notification, qui peut être manipulé à travers la boucle de messages ou avec la fonction GUICtrlSetOnEvent(), est générée (comme si le contrôle avait été "cliqué").

source: Note that the function will not action the dummy control if the GUI in which it was created is hidden, as by design none of the controls on such a GUI can be actioned.
fr: Notez que la fonction ne sera pas l'action du contrôle factice si la GUI dans laquelle il a été créé est cachée, comme pendant la conception où aucun contrôle ne peut être exécuté.

source: Set the option to use GUIOnEventMode.
fr: Définit l'option GUIOnEventMode.

source: Change the background color of the GUI.
fr: Change la couleur du fond de la GUI.

source: Set an event to call the 'OnExit' function.
fr: Définit un événement pour appeler la fonction 'OnExit'.

source: Set an event to call the 'OnExit' function when this control is selected.
fr: Définit un événement pour appeler la fonction 'OnExit' lorsque ce contrôle est sélectionné.

source: Set an event to call the 'OnClick' function when this control is selected.
fr: Définir un événement pour appeler la fonction 'OnClick' lorsque ce contrôle est sélectionné.

source: Set state to be checked Onclick
fr: Définition de l'état d'être coché sur Onclick

source: Send a message to the dummy control that the close button was selected, which will then proceed to call the function 'OnExit'.
fr: Envoie un message au contrôle factice que le bouton de fermeture a été choisi, et que la fonction 'OnExit' sera appelée.

source: Change the background color of the GUI on dummy state
fr: Change la couleur de fond de la GUI sur l'état factice

source: Exit the script.
fr: Sortie du script.

source: Sets the background color of a control.
fr: Définit la couleur de fond d'un contrôle.

source: The RGB color to use.
fr: La couleur RVB à utiliser.

source: Only Button, Label, Checkbox, Group, Radio, Edit, Input, List, Listview, ListviewItem, Treeview, TreeviewItem, Graphic, Progress, Slider and Combo controls can currently be colored.
fr: Seuls les contrôles Button, Label, Checkbox, Group, Radio, Edit, Input, List, Listview, ListviewItem, Treeview, TreeviewItem, Graphic, Progress, Slider et Combo peuvent actuellement être colorés.

source: Progress controls cannot be painted if the "Windows XP style" is used.
fr: Les contrôles Progress ne peuvent pas être peints si le "style Windows XP" est utilisé.

source: Checkbox, Radio, Group Progress, Combo controls cannot be painted if the "Windows XP/Vista style" is used.
fr: Les contrôles Checkbox, Radio, Groupe Progrès, Combo ne peuvent pas être peints si le "style de Windows XP/Vista" est utilisé.

source: Button controls are always painted in "Windows Classic style".
fr: Les contrôles Button sont toujours peints en "style Windows Classique".

source: They cannot have the $BS_ICON style.
fr: Ils ne peuvent pas avoir le style $BS_ICON.

source: The special flag $GUI_BKCOLOR_TRANSPARENT can be used with Label, Group, Radio, Checkbox controls to give them a transparent background.
fr: Le drapeau spécial $GUI_BKCOLOR_TRANSPARENT peut être utilisé avec es contrôles Label, Group, Radio, Checkbox pour leur donner un fond transparent.

source: Create a label control.
fr: Crée un contrôle Label.

source: Set the background color of the label control.
fr: Définit la couleur de fond du contrôle Label.

source: Sets the text color of a control.
fr: Définit la couleur du texte d'un contrôle.

source: Only Button, Label, Checkbox, Group, Radio, Edit, Input, List, Listview, ListviewItem, Treeview, TreeviewItem, Graphic, Progress and Combo controls can currently be colored.
fr: Seuls les contrôles Button, Label, Checkbox, Group, Radio, Edit, Input, List, Listview, ListviewItem, Treeview, TreeviewItem, Graphic, Progress et Combo peuvent actuellement être coloré.

source: Checkbox, Radio, Group or Progress controls cannot be painted if the "Windows XP/Vista style" is used.
fr: Les contrôles Checkbox, Radio, Group or Progress ne peuvent pas être peints si le "style de Windows XP/Vista" est utilisé.

source: Set the color of the label control.
fr: Définit la couleur du contrôle Label.

source: Sets the mouse cursor icon for a particular control.
fr: Définit l'icône du curseur de la souris pour un contrôle particulier.

source: cursor ID as used by Windows SetCursor API (use -1 for the default mouse cursor for the control)
fr: L'ID du curseur utilisé par l'API Windows SetCursor (utilisez -1 pour le curseur de la souris par défaut pour le contrôle)

source: Unlike GUISetCursor() which changes the mouse cursor for an entire window, this function sets the mouse cursor that is used when the mouse is hovering over the specified control.
fr: Contrairement à GUISetCursor() qui modifie le curseur de la souris pour une fenêtre entière, cette fonction définit le curseur de la souris qui est utilisé lorsque la souris survole le contrôle spécifié.

source: If the cursorID is invalid the standard arrow will be displayed.
fr: Si le cursorID est invalide la flèche standard sera affichée.

source: For a list of valid cursor IDs see MouseGetCursor().
fr: Pour une liste d'ID de curseurs valables consultez MouseGetCursor().

source: CursorId = 16 will hide the mouse cursor.
fr: CursorID = 16 permet de masquer le curseur de la souris.

source: Modifies the data for a control.
fr: Modifie les données d'un contrôle.

source: Combo, List, ListView, ListViewItem:
fr: Combo, Liste, ListView, ListViewItem :

source: An Opt("GUIDataSeparatorChar",...) separated list of items.
fr: Le caractère Opt("GUIDataSeparatorChar",...)est utilisé comme séparateur.

source: The percentage.
fr: Le pourcentage.

source: The value.
fr: La valeur.

source: Replaces the text.
fr: Remplace le texte.

source: The date or time depending the style of the control and the regional settings.
fr: La date ou l'heure selon le style du contrôle et des paramètres régionaux.

source: The default value.
fr: La valeur par défaut.

source: If non-empty (""), the string is inserted at the current insertion point (caret).
fr: Si non vide (""), la chaîne est insérée au point d'insertion courant (caret).

source: -1 in case of invalid data
fr: -1 En cas de données non valides

source: For Combo or List control :
fr: Pour les contrôles Combo ou List :

source: If the "data" corresponds to an already existing entry it is set as the default.
fr: Si la "donnée" correspond à une entrée déjà existante, elle est définie comme la valeur par défaut.

source: If the "data" starts with GUIDataSeparatorChar or is an empty string "" the previous list is destroyed.
fr: Si la "donnée" commence par GUIDataSeparatorChar ou est une chaîne vide "" la liste précédente est détruite.

source: For ListView, ListViewItem controls :
fr: Pour les contrôles ListView, ListViewItem :

source: To update a specific column just forget about the others ie "||update" to update 3rd column.
fr: Pour mettre à jour une colonne spécifique il suffit d'oublier les autres c'est-à-dire "||update" pour mettre à jour la 3ème colonne.

source: If "update" is empty the column/subitem will be erased.
fr: Si "update" est vide, la colonne/sous-item sera effacé.

source: For example "|" will erase the second column/subitem, "" will erase the first.
fr: Par exemple "|" effacera la deuxième colonne/sous-item, "" effacera la première.

source: For Monthcal controls :
fr: Pour les contrôles Monthcal :

source: The "data" date format is "yyyy/mm/dd".
fr: Le format date de la "donnée" est "yyyy/mm/dd".

source: For Date controls:
fr: Pour les contrôles Date :

source: The date and time is in the format defined by the regional settings.
fr: La date et l'heure est au format défini par les paramètres régionaux.

source: GUICtrlRead() use the same default format.
fr: GUICtrlRead() utilise le même format par défaut.

source: will display an empty dialog box with a combo control with focus on
fr: Affiche une boîte de dialogue vide avec un contrôle Combo et le focus dessus

source: Sets the default background color of all the controls of the GUI window.
fr: Définit la couleur de fond par défaut de tous les contrôles de la fenêtre GUI.

source: Default background color for all controls.
fr: Couleur de fond par défaut pour tous les contrôles.

source: Windows handle as returned by GUICreate() (default is the previously used window).
fr: Handle de la fenêtre retourné par GUICreate() (par défaut, la fenêtre précédemment utilisé ).

source: will change text color for all defined controls
fr: Change la couleur du texte pour tous les contrôles définies

source: will change text color for specified control
fr: Change la couleur du texte pour le contrôle spécifié

source: Sets the default text color of all the controls of the GUI window.
fr: Définit la couleur de texte par défaut de tous les contrôles d'une fenêtre GUI.

source: Default text color for all controls.
fr: La couleur du texte par défaut pour tous les contrôles.

source: Sets the font for a control.
fr: Définit la police d'un contrôle.

source: Fontsize (default is 8.5).
fr: Taille de la police (par défaut 8.5).

source: The weight of the font in the range 0 through 1000.For example, 400 is normal and 700 is bold.
fr: Graisse de la police dans la plage 0-1000; par exemple, 400 est normal et 700 est en gras.

source: If this value is zero, a default weight is used.
fr: Si cette valeur est égale à zéro, une graisse par défaut est utilisée.

source: The following values are defined for convenience.
fr: Les valeurs suivantes sont définies pour des raisons pratiques.

source: $FW_DONTCARE = 0 (Use the default font weight)
fr: $FW_DONTCARE = 0 (Utilise le poids de la police par défaut)

source: Constants are defined in FontConstants.au3
fr: Les constantes sont définies dans FontConstants.au3

source: Font attributes, which can be a combination of the following added together:
fr: Attributs de police, qui peut être une combinaison des éléments suivants additionnés :

source: $GUI_FONTITALIC (2) = Italic
fr: $GUI_FONTITALIC ( 2 ) = Italique

source: $GUI_FONTUNDER (4) = Underlined
fr: $GUI_FONTUNDER ( 4 ) = Souligné

source: $GUI_FONTSTRIKE (8) = Strike
fr: $GUI_FONTSTRIKE ( 8 ) = Barré

source: Constants are defined in GUIConstantsEx.au3
fr: Les constantes sont définies dans GUIConstantsEx.au3

source: Name of the font to use.
fr: Nom de la police à utiliser.

source: (OS default GUI font is used if the font is "" or is not found).
fr: (police par défaut de l'OS utilisée si la police est "" ou introuvable).

source: Font quality to select.
fr: Qualité de la police à sélectionner.

source: The following qualities are accepted:
fr: Les qualités suivantes sont acceptées:

source: $DEFAULT_QUALITY (0) = Appearance of the font does not matter.
fr: $DEFAULT_QUALITY ( 0 ) = L'apparence de la police n'a pas d'importance.

source: $DRAFT_QUALITY (1) = Appearance of the font is less important than when $PROOF_QUALITY is used.
fr: $DRAFT_QUALITY ( 1 ) = L'apparence de la police est moins importante que lorsque $PROOF_QUALITY est utilisé.

source: For GDI raster fonts, scaling is enabled, which means that more font sizes are available, but the quality may be lower.Bold, italic, underline, and strikeout fonts are synthesized if necessary.
fr: Pour les polices raster GDI, la mise à l'échelle est activée, ce qui signifie que plusieurs tailles de police sont disponibles, mais la qualité peut être inférieure.Les polices Gras, italique, souligné, et barré sont synthétisés si nécessaire.

source: $PROOF_QUALITY (2) = (default) Character quality of the font is more important than exact matching of the logical-font attributes.
fr: $PROOF_QUALITY ( 2 ) = (par défaut) La qualité des caractères de la police est plus importante que d'adapter exactement les attributs logique de la police.

source: For GDI raster fonts, scaling is disabled and the font closest in size is chosen.
fr: Pour les polices raster GDI, la mise à l'échelle est désactivée et la police la plus proche en taille est choisie.

source: Although the chosen font size may not be mapped exactly when $PROOF_QUALITY is used, the quality of the font is high and there is no distortion of appearance.
fr: Bien que la taille de la police choisie ne peut pas être mappé exactement quand $PROOF_QUALITY est utilisé, la qualité de la police est élevé et il n'y a pas de distorsion de l'apparence.

source: Bold, italic, underline, and strikeout fonts are synthesized if necessary.
fr: Les polices gras, italique, souligné, et barré sont synthétisés si nécessaire.

source: $NONANTIALIASED_QUALITY (3) = Font is never antialiased.
fr: $NONANTIALIASED_QUALITY ( 3 ) = la police n'est jamais anti-crénelé.

source: $ANTIALIASED_QUALITY (4) = Font is always antialiased if the font supports it and the size of the font is not too small or too large.
fr: $ANTIALIASED_QUALITY ( 4 ) = la police est toujours anti-crénelé si la police le prend en charge et si la taille de la police n'est pas trop petit ou trop grande.

source: $CLEARTYPE_QUALITY (5) = If set, text is rendered (when possible) using ClearType antialiasing method.
fr: $CLEARTYPE_QUALITY ( 5 ) = Si défini, le rendu du texte est obtenu (si possible) en utilisant la méthode ClearType d'antialiasing.

source: See the remarks on the msdn page for LOGFONT for details about when cleartype is not available.
fr: Voir Remarques sur la page MSDN pour LOGFONT pour savoir quand ClearType n'est pas disponible.
